class AxiomElement:
    """
    Abstract base class for :class:`~sage.interfaces.axiom.AxiomElement`.

    This class is defined for the purpose of ``isinstance`` tests.  It should not be
    instantiated.

    EXAMPLES:

    By design, there is a unique direct subclass::

        sage: len(sage.interfaces.abc.AxiomElement.__subclasses__()) <= 1
        True
    """
class ExpectElement:
    """
    Abstract base class for :class:`~sage.interfaces.expect.ExpectElement`.

    This class is defined for the purpose of ``isinstance`` tests.  It should not be
    instantiated.

    EXAMPLES:

    By design, there is a unique direct subclass::

        sage: len(sage.interfaces.abc.ExpectElement.__subclasses__()) <= 1
        True
    """
class FriCASElement:
    """
    Abstract base class for :class:`~sage.interfaces.fricas.FriCASElement`.

    This class is defined for the purpose of ``isinstance`` tests.  It should not be
    instantiated.

    EXAMPLES:

    By design, there is a unique direct subclass::

        sage: len(sage.interfaces.abc.FriCASElement.__subclasses__()) <= 1
        True
    """
class GapElement:
    """
    Abstract base class for :class:`~sage.interfaces.gap.GapElement`.

    This class is defined for the purpose of ``isinstance`` tests.  It should not be
    instantiated.

    EXAMPLES:

    By design, there is a unique direct subclass::

        sage: len(sage.interfaces.abc.GapElement.__subclasses__()) <= 1
        True
    """
class GpElement:
    """
    Abstract base class for :class:`~sage.interfaces.gp.GpElement`.

    This class is defined for the purpose of ``isinstance`` tests.  It should not be
    instantiated.

    EXAMPLES:

    By design, there is a unique direct subclass::

        sage: len(sage.interfaces.abc.GpElement.__subclasses__()) <= 1
        True
    """
class Macaulay2Element:
    """
    Abstract base class for :class:`~sage.interfaces.macaulay2.Macaulay2Element`.

    This class is defined for the purpose of ``isinstance`` tests.  It should not be
    instantiated.

    EXAMPLES:

    By design, there is a unique direct subclass::

        sage: len(sage.interfaces.abc.Macaulay2Element.__subclasses__()) <= 1
        True
    """
class MagmaElement:
    """
    Abstract base class for :class:`~sage.interfaces.magma.MagmaElement`.

    This class is defined for the purpose of ``isinstance`` tests.  It should not be
    instantiated.

    EXAMPLES:

    By design, there is a unique direct subclass::

        sage: len(sage.interfaces.abc.MagmaElement.__subclasses__()) <= 1
        True
    """
class SingularElement:
    """
    Abstract base class for :class:`~sage.interfaces.singular.SingularElement`.

    This class is defined for the purpose of ``isinstance`` tests.  It should not be
    instantiated.

    EXAMPLES:

    By design, there is a unique direct subclass::

        sage: len(sage.interfaces.abc.SingularElement.__subclasses__()) <= 1
        True
    """
